---
type: GradientBackgroundSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# GradientBackgroundSettings

`Autodesk.Revit.DB.GradientBackgroundSettings` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | GroundColor | 2014 | `public Color GroundColor { get ; set ; }` |
| Property | HorizonColor | 2014 | `public Color HorizonColor { get ; set ; }` |
| Property | SkyColor | 2014 | `public Color SkyColor { get ; set ; }` |